In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'name': ["Aarav Sharma","Priya Koirala","Rohan Thapa","Sita Gurung","Manish Shrestha","Sita Gurung","Aarav Sharma"],'total':[40,45,50,60,70,60,60]}

In [3]:
df= pd.DataFrame(data)

In [4]:
df

              name  total
0     Aarav Sharma     40
1    Priya Koirala     45
2      Rohan Thapa     50
3      Sita Gurung     60
4  Manish Shrestha     70
5      Sita Gurung     60
6     Aarav Sharma     60

In [5]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [6]:
df.duplicated().value_counts()

False    6
True     1
Name: count, dtype: int64

In [7]:
df.drop_duplicates()    
# df.drop_duplicates(keep= 'first')   remove all duplicate data except first

              name  total
0     Aarav Sharma     40
1    Priya Koirala     45
2      Rohan Thapa     50
3      Sita Gurung     60
4  Manish Shrestha     70
6     Aarav Sharma     60

In [8]:
df

              name  total
0     Aarav Sharma     40
1    Priya Koirala     45
2      Rohan Thapa     50
3      Sita Gurung     60
4  Manish Shrestha     70
5      Sita Gurung     60
6     Aarav Sharma     60

In [9]:
df.shape

(7, 2)

In [10]:
dataset = pd.read_csv('student_per.csv')
dataset.head()

,student_id,weekly_self_study_hours,attendance_percentage,class_participation,total_score,grade
0,1,18.5,95.6,3.8,97.9,A
1,2,14.0,80.0,2.5,83.9,B
2,3,19.5,86.3,5.3,100.0,A
3,4,25.7,70.2,7.0,100.0,A
4,5,13.4,81.9,6.9,92.0,A

In [11]:
dataset.duplicated().value_counts()

False    998
Name: count, dtype: int64

In [12]:
dataset.drop_duplicates()

,student_id,weekly_self_study_hours,attendance_percentage,class_participation,total_score,grade
0,1,18.5,95.6,3.8,97.9,A
1,2,14.0,80.0,2.5,83.9,B
2,3,19.5,86.3,5.3,100.0,A
3,4,25.7,70.2,7.0,100.0,A
4,5,13.4,81.9,6.9,92.0,A
...,...,...,...,...,...,...
993,994,10.2,77.6,4.0,76.8,B
994,995,8.0,94.0,5.4,66.2,C
995,996,13.0,72.5,3.2,78.1,B
996,997,27.6,92.9,6.5,100.0,A
997,998,19.5,70.2,5.5,91.7,A

In [13]:
dataset.count()

student_id                 998
weekly_self_study_hours    998
attendance_percentage      998
class_participation        998
total_score                998
grade                      998
dtype: int64